
#### Terraform Plan

```Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform/app_environment relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cms/cms/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cms/cms

To view this run in a browser, visit:
https://app.terraform.io/app/owenbendavies/cms-production/runs/run-vcYLNTwHyGfN8MWo

Waiting for the plan to start...

Terraform v0.12.28
Configuring remote state backend...
Initializing Terraform configuration...
2020/07/21 19:19:07 [DEBUG] Using modified User-Agent: Terraform/0.12.28 TFC/0dd56fba6f
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_iam.aws_iam_user.app: Refreshing state... [id=obduk-cms-production]
module.aws_iam.data.aws_iam_policy_document.ses: Refreshing state...
module.aws_cloudfront.data.aws_caller_identity.main: Refreshing state...
module.aws_s3.aws_s3_bucket.logs: Refreshing state... [id=obduk-cms-production-logs]
module.aws_cloudfront.aws_cloudfront_origin_access_identity.assets: Refreshing state... [id=E140SVLNNNN5UD]
module.aws_sqs_default.aws_sqs_queue.main: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/414063456747/obduk-cms-production-default]
module.aws_sqs_mailers.aws_sqs_queue.main: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/414063456747/obduk-cms-production-mailers]
module.aws_s3.data.aws_caller_identity.main: Refreshing state...
module.aws_cognito.aws_cognito_user_pool.app: Refreshing state... [id=eu-west-1_s5JVuLde6]
module.aws_iam.aws_iam_user_policy.app_ses: Refreshing state... [id=obduk-cms-production:ses]
module.aws_iam.aws_iam_access_key.app: Refreshing state... [id=AKIAJWMLZLF4OQASWROQ]
module.aws_cognito.aws_cognito_user_pool_client.app: Refreshing state... [id=3d9q3crsvrs5lsffg3u4b28jk6]
module.aws_cognito.aws_cognito_user_pool_domain.app: Refreshing state... [id=obduk-cms-production]
module.aws_cognito.aws_cognito_user_group.admin: Refreshing state... [id=eu-west-1_s5JVuLde6/admin]
module.aws_cognito.aws_cognito_user_group.domains["obduk-cms-production.herokuapp.com"]: Refreshing state... [id=eu-west-1_s5JVuLde6/obduk-cms-production.herokuapp.com]
module.aws_cognito.aws_cognito_user_group.domains["www.spencerdown.com"]: Refreshing state... [id=eu-west-1_s5JVuLde6/www.spencerdown.com]
module.aws_iam.data.aws_iam_policy_document.cognito: Refreshing state...
module.aws_cognito.aws_cognito_user_group.domains["www.docklandssinfonia.co.uk"]: Refreshing state... [id=eu-west-1_s5JVuLde6/www.docklandssinfonia.co.uk]
module.aws_iam.aws_iam_user_policy.app_cognito: Refreshing state... [id=obduk-cms-production:cognito]
module.aws_iam.data.aws_iam_policy_document.sqs: Refreshing state...
module.aws_iam.aws_iam_user_policy.app_sqs: Refreshing state... [id=obduk-cms-production:sqs]
module.aws_s3.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=obduk-cms-production-logs]
module.aws_s3.aws_s3_bucket.assets: Refreshing state... [id=obduk-cms-production]
module.aws_iam.data.aws_iam_policy_document.s3: Refreshing state...
module.aws_s3.data.aws_iam_policy_document.assets: Refreshing state...
module.aws_s3.aws_s3_bucket_public_access_block.assets: Refreshing state... [id=obduk-cms-production]
module.aws_iam.aws_iam_user_policy.app_s3: Refreshing state... [id=obduk-cms-production:s3]
module.aws_cloudfront.aws_cloudfront_distribution.assets: Refreshing state... [id=E1FNM6XTUMJ818]
module.aws_s3.aws_s3_bucket_policy.assets: Refreshing state... [id=obduk-cms-production]
module.heroku.heroku_app.app: Refreshing state... [id=obduk-cms-production]
module.heroku.heroku_addon.app_librato: Refreshing state... [id=librato-tapered-93550]
module.heroku.heroku_domain.app["www.docklandssinfonia.co.uk"]: Refreshing state... [id=4fce9edf-ea13-497c-9a2f-6c0b8d35e7ff]
module.heroku.heroku_domain.app["www.spencerdown.com"]: Refreshing state... [id=923c700c-c59b-43dc-ab56-369519047276]
module.heroku.heroku_formation.app_worker: Refreshing state... [id=8496e6ab-4183-4b74-bf7d-0232ffa3215a]
module.heroku.heroku_addon.app_postgresql: Refreshing state... [id=postgresql-concentric-16775]
module.heroku.heroku_app_feature.api_runtime_dyno_metadata: Refreshing state... [id=obduk-cms-production:33146ed7-199e-4a8a-b648-08fd0b52e10d]
module.heroku.heroku_addon.app_scheduler: Refreshing state... [id=scheduler-polished-75678]
module.heroku.heroku_app_feature.app_log_runtime_metrics: Refreshing state... [id=obduk-cms-production:log-runtime-metrics]
module.heroku.heroku_addon.app_logentries: Refreshing state... [id=81f2f48e-954c-4b26-81b9-3f2ce0a24dda]
module.heroku.heroku_addon.app_rollbar: Refreshing state... [id=rollbar-globular-7617]
module.heroku.heroku_formation.app_web: Refreshing state... [id=02b822b3-6c4d-4231-ba50-26b479dafa02]
module.heroku.heroku_addon.app_scout: Refreshing state... [id=bb6ba86c-4a26-4135-b542-21d38b0bd722]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws_cloudfront.aws_cloudfront_distribution.assets will be updated in-place
  ~ resource "aws_cloudfront_distribution" "assets" {
        active_trusted_signers         = {
            "enabled" = "false"
            "items.#" = "0"
        }
        aliases                        = []
        arn                            = "arn:aws:cloudfront::414063456747:distribution/E1FNM6XTUMJ818"
        caller_reference               = "obduk-cms-production-CloudFront-OLX9UKSUSQQK"
      ~ comment                        = "obduk-cms-production" -> "cms-production"
        domain_name                    = "d17li6kig20nxs.cloudfront.net"
        enabled                        = true
        etag                           = "E2AW2MXR64E2SF"
        hosted_zone_id                 = "Z2FDTNDATAQYW2"
        http_version                   = "http2"
        id                             = "E1FNM6XTUMJ818"
        in_progress_validation_batches = 0
        is_ipv6_enabled                = true
        last_modified_time             = "2020-06-25 17:29:21.48 +0000 UTC"
        price_class                    = "PriceClass_All"
        retain_on_delete               = false
        status                         = "Deployed"
        tags                           = {
            "environment" = "production"
            "project"     = "cms"
        }
        wait_for_deployment            = true

        default_cache_behavior {
            allowed_methods        = [
                "GET",
                "HEAD",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
            ]
            compress               = true
            default_ttl            = 86400
            max_ttl                = 31536000
            min_ttl                = 0
            smooth_streaming       = false
            target_origin_id       = "S3"
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = []
                query_string            = false
                query_string_cache_keys = []

                cookies {
                    forward           = "none"
                    whitelisted_names = []
                }
            }
        }

      ~ logging_config {
            bucket          = "obduk-cms-production-logs.s3.amazonaws.com"
            include_cookies = false
          ~ prefix          = "AWSLogs/414063456747/cloudfront/obduk-cms-production/" -> "AWSLogs/414063456747/cloudfront/cms-production/"
        }

        origin {
            domain_name = "obduk-cms-production.s3.amazonaws.com"
            origin_id   = "S3"

            s3_origin_config {
                origin_access_identity = "origin-access-identity/cloudfront/E140SVLNNNN5UD"
            }
        }

        restrictions {
            geo_restriction {
                locations        = []
                restriction_type = "none"
            }
        }

        viewer_certificate {
            cloudfront_default_certificate = true
            minimum_protocol_version       = "TLSv1"
        }
    }

  # module.aws_cloudfront.aws_cloudfront_origin_access_identity.assets will be updated in-place
  ~ resource "aws_cloudfront_origin_access_identity" "assets" {
        caller_reference                = "511a3597-33ce-4ca4-936b-26ed7c920d60"
        cloudfront_access_identity_path = "origin-access-identity/cloudfront/E140SVLNNNN5UD"
      ~ comment                         = "obduk-cms-production" -> "cms-production"
        etag                            = "E1ONV5UZ8QHNOA"
        iam_arn                         = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E140SVLNNNN5UD"
        id                              = "E140SVLNNNN5UD"
        s3_canonical_user_id            = "89966b6a26b1af6165e2905d1396080515a47f0f01bb1c803f739a3c934a758bd1618c8b3130876b47be34701bfcbb0b"
    }

  # module.aws_iam.aws_iam_access_key.app must be replaced
-/+ resource "aws_iam_access_key" "app" {
      + encrypted_secret     = (known after apply)
      ~ id                   = "AKIAJWMLZLF4OQASWROQ" -> (known after apply)
      + key_fingerprint      = (known after apply)
      ~ secret               = (sensitive value)
      ~ ses_smtp_password    = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      ~ status               = "Active" -> (known after apply)
      ~ user                 = "obduk-cms-production" -> "cms-production" # forces replacement
    }

  # module.aws_iam.aws_iam_user.app will be updated in-place
  ~ resource "aws_iam_user" "app" {
        arn           = "arn:aws:iam::414063456747:user/obduk-cms-production"
        force_destroy = false
        id            = "obduk-cms-production"
      ~ name          = "obduk-cms-production" -> "cms-production"
        path          = "/"
        tags          = {
            "environment" = "production"
            "project"     = "cms"
        }
        unique_id     = "AIDAIVJP6YPUQQQ7MZD7Y"
    }

  # module.aws_iam.aws_iam_user_policy.app_cognito must be replaced
-/+ resource "aws_iam_user_policy" "app_cognito" {
      ~ id     = "obduk-cms-production:cognito" -> (known after apply)
        name   = "cognito"
        policy = jsonencode(
            {
                Statement = [
                    {
                        Action   = "cognito-idp:ListUsersInGroup"
                        Effect   = "Allow"
                        Resource = "arn:aws:cognito-idp:eu-west-1:414063456747:userpool/eu-west-1_s5JVuLde6"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ user   = "obduk-cms-production" -> "cms-production" # forces replacement
    }

  # module.aws_iam.aws_iam_user_policy.app_s3 must be replaced
-/+ resource "aws_iam_user_policy" "app_s3" {
      ~ id     = "obduk-cms-production:s3" -> (known after apply)
        name   = "s3"
        policy = jsonencode(
            {
                Statement = [
                    {
                        Action   = "s3:ListBucket"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::obduk-cms-production"
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "s3:PutObjectAcl",
                            "s3:PutObject",
                            "s3:GetObjectAcl",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::obduk-cms-production/*"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ user   = "obduk-cms-production" -> "cms-production" # forces replacement
    }

  # module.aws_iam.aws_iam_user_policy.app_ses must be replaced
-/+ resource "aws_iam_user_policy" "app_ses" {
      ~ id     = "obduk-cms-production:ses" -> (known after apply)
        name   = "ses"
        policy = jsonencode(
            {
                Statement = [
                    {
                        Action   = "ses:SendRawEmail"
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ user   = "obduk-cms-production" -> "cms-production" # forces replacement
    }

  # module.aws_iam.aws_iam_user_policy.app_sqs must be replaced
-/+ resource "aws_iam_user_policy" "app_sqs" {
      ~ id     = "obduk-cms-production:sqs" -> (known after apply)
        name   = "sqs"
        policy = jsonencode(
            {
                Statement = [
                    {
                        Action   = [
                            "sqs:SendMessage",
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueUrl",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                            "sqs:ChangeMessageVisibility",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:sqs:eu-west-1:414063456747:obduk-cms-production-mailers",
                            "arn:aws:sqs:eu-west-1:414063456747:obduk-cms-production-default",
                        ]
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ user   = "obduk-cms-production" -> "cms-production" # forces replacement
    }

  # module.aws_sqs_default.aws_sqs_queue.main must be replaced
-/+ resource "aws_sqs_queue" "main" {
      ~ arn                               = "arn:aws:sqs:eu-west-1:414063456747:obduk-cms-production-default" -> (known after apply)
        content_based_deduplication       = false
        delay_seconds                     = 0
        fifo_queue                        = false
      ~ id                                = "https://sqs.eu-west-1.amazonaws.com/414063456747/obduk-cms-production-default" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
        max_message_size                  = 262144
        message_retention_seconds         = 345600
      ~ name                              = "obduk-cms-production-default" -> "cms-production-default" # forces replacement
      + policy                            = (known after apply)
        receive_wait_time_seconds         = 0
        tags                              = {
            "environment" = "production"
            "project"     = "cms"
        }
        visibility_timeout_seconds        = 30
    }

  # module.aws_sqs_mailers.aws_sqs_queue.main must be replaced
-/+ resource "aws_sqs_queue" "main" {
      ~ arn                               = "arn:aws:sqs:eu-west-1:414063456747:obduk-cms-production-mailers" -> (known after apply)
        content_based_deduplication       = false
        delay_seconds                     = 0
        fifo_queue                        = false
      ~ id                                = "https://sqs.eu-west-1.amazonaws.com/414063456747/obduk-cms-production-mailers" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
        max_message_size                  = 262144
        message_retention_seconds         = 345600
      ~ name                              = "obduk-cms-production-mailers" -> "cms-production-mailers" # forces replacement
      + policy                            = (known after apply)
        receive_wait_time_seconds         = 0
        tags                              = {
            "environment" = "production"
            "project"     = "cms"
        }
        visibility_timeout_seconds        = 30
    }

  # module.heroku.heroku_app.app will be updated in-place
  ~ resource "heroku_app" "app" {
        acm                   = false
        all_config_vars       = (sensitive value)
        buildpacks            = [
            "heroku/nodejs",
            "heroku/ruby",
        ]
        config_vars           = {}
        git_url               = "https://git.heroku.com/obduk-cms-production.git"
        heroku_hostname       = "obduk-cms-production.herokuapp.com"
        id                    = "obduk-cms-production"
        internal_routing      = false
        name                  = "obduk-cms-production"
        region                = "eu"
      ~ sensitive_config_vars = (sensitive value)
        stack                 = "heroku-18"
        uuid                  = "8073d958-6a6d-4400-84fd-01b42d778c2e"
        web_url               = "https://obduk-cms-production.herokuapp.com/"
    }

Plan: 7 to add, 4 to change, 7 to destroy.
```
